In [1]:
import pandas as pd

In [2]:
items = [
    {'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes': 8, 'suits': 45},
    {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5, 'shirts': 2, 'shoes': 5, 'suits': 7},
    {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes': 10}
        ]
store_items = pd.DataFrame(items, index=['store1', 'store2', 'store3'])
store_items

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      NaN
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     NaN     10    NaN      4.0

In [5]:
# count the number of nan values
x = store_items.isnull().sum().sum()
print(x)

3

In [6]:
# count the number of non nan values
x = store_items.count().sum()
print(x)

18

In [7]:
# replace all nans with 0
store_items.fillna(0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      0.0
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     0.0     10    0.0      4.0

In [11]:
# forward fill nans (from prev row)
store_items.ffill(axis=0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      NaN
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     2.0     10    7.0      4.0

In [9]:
# forward fill nans (from prev col)
store_items.ffill(axis=1)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store3   20.0   30.0     35.0    35.0   10.0   10.0      4.0